<template>
  <div class="term-wrapper">
    <div class="term-header">
      <h1>ข้อตกลงและเงื่อนไขการใช้บริการเว็บไซต์</h1>
      <h1>ศูนย์รวมข้อมูลอสังหาริมทรัพย์เพื่ออยู่อาศัย</h1>
    </div>
    <p>
      ยินดีต้อนรับสู่เว็บไซต์ศูนย์รวมข้อมูลที่อยู่อาศัยให้เช่า เว็บไซต์นี้
      จัดทำขึ้นและดำเนินการโดย กลุ่มผู้จัดทำโครงงานของมหาวิทยาลัยกรุงเทพ
      ภาควิชาเทคโนโลยีสารสนเทศ คณะเทคโนโลยีสารสนเทศและนวัตกรรม
    </p>
    <p>
      ผู้เข้าเยื่ยมชมเว็บไซต์นี้จะต้องถูกผูกพันตามข้อตกลงและเงื่อนไขในเว็บไซต์นี้
      ดังนั้นขอความกรุณาผู้เข้าเยื่ยมชมเว็บไซต์อ่านข้อตกลงและเงื่อนไขเหล่านี้ด้วยความระมัดระวังก่อนทำธุรกรรมใด
      ๆ บนเว็บไซต์นี้
    </p>
    <h1>1.การใช้งานเว็บไซต์</h1>
    <p>
      เว็บไซต์นี้อาจจะมีการเปลี่ยนแปลงข้อตกลงและเงื่อนไขการให้บริการเป็นครั้งคราว
      ดังนั้นผู้เข้าเยี่ยมชมเว็บไซต์นี้ ควรเข้ามาอ่านรายละเอียดอย่างสมำ่เสมอ
      เพื่อช่วยให้ได้รับข้อมูลข้อตกลงและเงื่อนไขการให้บริการที่มีการเปลี่ยนแปลง
    </p>
    <p>
      ท่านยินยอมว่าท่านจะไม่ใช้เว็บไซต์นี้ หรือบริการของเว็บไซต์ ดำเนินการใดๆ
      ในการ รวบรวมข้อมูล, ของลูกค้าหรือผู้ลงโฆษณา
    </p>
    <p>
      ท่านยินยอมที่จะไม่กระทำการสิ่งต่างๆ เหล่านี้ ใช้ซอฟต์แวร์อัตโนมัติ (bots)
      , เจาะระบบฐานข้อมูล, แก้ไขดัดแปลงหรือ การปรับเปลี่ยน
      การเข้าถึงข้อมูลด้วยซอฟต์แวร์อื่นๆ,
      การรวบรวมข้อมูลหรือการเก็บข้อมูลจากโครงงานเว็บไซต์ศูนย์รวมข้อมูลที่อยู่อาศัยให้เช่า
      และ/หรือข้อมูลและบริการอื่นๆ โดยเด็ดขาด
    </p>
    <p>
      ท่านยินยอมที่จะไม่กระทำการ ใช้ซอฟต์แวร์ใดๆ
      ในการนำข้อมูลและบริการส่วนหนึ่งส่วนใด
      จากโครงงานเว็บไซต์ศูนย์รวมข้อมูลที่อยู่อาศัยให้เช่า
      ไปใช้โดยไม่ได้รับอนุญาตโดยเด็ดขาด
    </p>
    <p>
      เว็บไซต์ศูนย์รวมข้อมูลที่อยู่อาศัยให้เช่าใช้ความพยายามอย่างสมเหตุสมผลในการเก็บรวบรวมข้อมูลให้ล่าสุด
      ถูกต้อง อยู่ตลอดเวลา อย่างไรก็ตามทางผู้จัดทำโครงงาน ไม่รับประกัน
      หรือรับรองความเที่ยงตรงของข้อมูล โดยเฉพาะอย่างยิ่งทางผู้จัดทำโครงงาน
      จะไม่ยอมรับหรือรับผิดชอบต่อ ข้อผิดพลาดใดๆ หรือการละเลยเนื้อหาในเว็บไซต์นี้
    </p>
    <h1>2.การจัดส่งข้อมูลในเว็บไซต์</h1>
    <p>
      ข้อมูลทุกชนิดที่ท่านจัดส่งให้เว็บไซต์ศูนย์รวมข้อมูลที่อยู่อาศัยให้เช่า
      จะถือว่าเป็นข้อมูลที่ไม่เป็นความลับ และไม่เป็นกรรมสิทธิ์แต่อย่างใด
      ทุกสิ่งที่ท่านได้จัดส่งเผยแพร่หรือโพสต์ประกาศ
      ทางผู้จัดทำโครงงานสามารถใช้ข้อมูลดังกล่าวโดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น
    </p>
    <p>
      ท่านจะต้องยอมรับว่าข้อมูลที่ท่านได้โพสต์ลงเว็บไซต์เรา
      ไม่ได้เป็นการละเมิดสิทธิ์จากบุคคลที่สาม รวมถึงลิขสิทธิ์,
      เครื่องหมายการค้า, ความเป็นส่วนตัว หรือสินทรัพย์ที่เป็นสิทธิส่วนบุคคลอื่น
      ท่านจะต้องเป็นผู้รับผิดชอบข้อมูลทั้งหมดแต่เพียงผู้เดียว
    </p>
    <p>
      เมื่อท่านใช้งานเว็บไซต์นี้
      ท่านจะต้องยินยอมให้เว็บไซต์ศูนย์รวมข้อมูลที่อยู่อาศัยให้เช่า
      เก็บรวบรวมข้อมูลเกี่ยวกับท่านและการใช้งานเว็บไซต์ของท่านหรือมีสิทธิในการใช้ข้อมูลดังกล่าวตามที่ได้ระบุไว้ในนโยบายความเป็นส่วนตัวของผู้จัดทำโครงงาน
    </p>
    <h1>3.การเชื่อมโยงกับเว็บไซต์อื่นๆ</h1>
    <p>
      เว็บไซต์นี้อาจมีการเชื่อมต่อกับเว็บไซต์อื่น ๆ
      การเชื่อมต่อนี้เพื่อช่วยให้ท่านค้นหาเว็บไซต์ บริการ และ/หรือ
      ผลิตภัณฑ์ที่เกี่ยวข้องได้อย่างรวดเร็วและง่ายด่าย เราไม่มีอำนาจที่จะควบคุม
      รับรองยืนยันความถูกต้องหรือความน่าเชื่อถือหรือรับผิดชอบในเนื้อหาของเว็บไซต์ของบุคคล
      ภายนอก หรือการเชื่อมต่อใด ๆ ที่บรรจุอยู่ในเว็บไซต์ของบุคคลภายนอก
      การตัดสินใจว่าบริการ และ/
      หรือผลิตภัณฑ์ที่นำเสนอผ่านเว็บไซต์เหล่านี้สอดคล้องกับวัตถุประสงค์ของท่านหรือไม่นั้น
      เป็น ความรับผิดชอบของท่านเอง
      ทางผู้จัดทำโครงงานไม่สามารถควบคุมและจะไม่รับผิดชอบเนื้อหาของเว็บไซต์เหล่านั้นใดๆ
      ทั้งสิ้น และทางผู้จัดทำโครงงานไม่ได้มีส่วน
      เกี่ยวข้องในการกำหนดถึงการรับประกันใด ๆ
      หรือต้องรับภาระค่าเสียหายที่เกี่ยวพันกับเจ้าของ
      หรือผู้ดำเนินงานของเว็บไซต์ใด ๆ (รวมทั้งความเสียหายที่เกิดจากข้ออ้างใด ๆ
      ก็ตามที่ละเมิด
      ลิขสิทธิหรือทรัพย์สินทางปัญญาประเภทอื่นของเว็บไซต์ของบุคคลที่สาม)
    </p>
    <h1>4.การปฏิเสธความรับผิดและข้อจำกัดความรับผิด</h1>
    <p>
      ท่านจะต้องยอมรับว่า เมื่อท่านเข้าใช้บริการเว็บไซต์นี้แล้ว
      ท่านยอมรับความเสี่ยง ท่านต้องรับผิดชอบ
      สำหรับค่าใช้จ่ายทั้งหมดที่จะเกิดขึ้น (ถ้ามี) จากการเข้าใช้งานของท่าน
      ทางผู้จัดทำโครงงาน จะไม่รับผิดชอบต่อความเสียหายใดๆ, ความสูญเสีย,
      ค่าใช้จ่าย, การเรียกร้องหรือความต้องการใดๆ, ไม่ว่าจะโดยตรง, โดยอ้อม,
      การชดเชยหรือผลเสียหายที่เกิดขึ้น,
      ความเกี่ยวข้องกับการใช้งานเว็บไซต์นี้ของท่านหรือข้อมูลเนื้อหา,
      ส่วนประกอบหรือผลิตภัณฑ์ที่รวมอยู่บนเว็บไซต์นี้ หลักเกณฑ์เหล่านี้
      อยู่ภายใต้กฎหมายของประเทศไทย หากเกิดข้อพิพาทใดๆ
      จะได้รับการแก้ไขโดยศาลยุติธรรม
    </p>
    <h1>5.การเปลี่ยนแปลงข้อตกลงและเงื่อนไข</h1>
    <p>
      การดำเนินของจัดทำโครงงานของเรา ได้มีการพัฒนาอยู่เสมอ
      ดังนั้นนโยบายความเป็นส่วนตัว, ข้อตกลงและเงื่อนไขการใช้บริการ
      อาจจะมีการเปลี่ยนแปลงอยู่เป็นครั้งคราว
      ทางผู้จัดทำโครงงารแนะนำให้ท่านมีการตรวจสอบอย่างต่อเนื่อง
      เพื่อติดตามว่ามีการแก้ไข หรือเพิ่มข้อกำหนดในส่วนใด
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style>
.term-wrapper {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
  font-family: "kanit" !important;
}
.term-header {
  text-align: center;
}
.term-wrapper h1 {
  font-size: 1.3rem;
  font-weight: bold;
  margin-bottom: 1rem;
}

.term-wrapper p {
  font-size: 1rem;
  line-height: 1.5;
}
</style>
