<template>
  <div class="term-wrapper">
    <div class="term-header">
      <h1>นโยบายการคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)</h1>
      <h1>ศูนย์รวมข้อมูลอสังหาริมทรัพย์เพื่ออยู่อาศัย</h1>
    </div>
    <p>
      ศออ. ตระหนักถึงความสำคัญของข้อมูลส่วนบุคคลและข้อมูลอื่นอันเกี่ยวกับท่าน
      (รวมเรียกว่า “ข้อมูล”) เพื่อให้ท่านสามารถเชื่อมั่นได้ว่า
      ทางเรามีความโปร่งใสและความรับผิดชอบในการเก็บรวบรวม
      ใช้หรือเปิดเผยข้อมูลของท่านตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
      2562 (“กฎหมายคุ้มครองข้อมูลส่วนบุคคล”) รวมถึงกฎหมายอื่นที่เกี่ยวข้อง
      นโยบายการคุ้มครองข้อมูลส่วนบุคคล (“นโยบาย”)
      นี้จึงได้ถูกจัดทำขึ้นเพื่อชี้แจงแก่ท่านถึงรายละเอียดเกี่ยวกับการเก็บรวบรวม
      ใช้หรือเปิดเผย (รวมเรียกว่า “ประมวลผล”) ข้อมูลส่วนบุคคลซึ่งดำเนินการโดย
      ศออ. รวมถึงเจ้าหน้าที่และบุคคลที่เกี่ยวข้องผู้ดำเนินการแทนหรือในนามของ
      ศออ. โดยมีเนื้อหาสาระดังต่อไปนี้
    </p>
    <h1>1.ขอบเขตการบังคับใช้นโยบาย</h1>
    <p>
      นโยบายนี้ใช้บังคับกับข้อมูลส่วนบุคคลของบุคคลซึ่งมีความสัมพันธ์กับ ศออ.
      ในปัจจุบันและที่อาจมีในอนาคต ซึ่งถูกประมวลผลข้อมูลส่วนบุคคลโดย
      เจ้าหน้าที่ผู้ดูแลระบบที่ดำเนินการโดยทางเรา ในนามของ ศออ.
      (“ผู้ประมวลผลข้อมูลส่วนบุคคล”) ภายใต้บริการต่าง ๆ เช่น ฐานข้อมูล ระบบ
      แอปพลิเคชัน เอกสาร หรือบริการในรูปแบบอื่นที่ควบคุมดูแลโดย ศออ.
      (รวมเรียกว่า “บริการ”) บุคคลมีความสัมพันธ์กับ ศออ. ตามความในวรรคแรก รวมถึง
      1) ผู้ใช้ทั่วไปหรือบุคคลธรรมดา 2) เจ้าหน้าที่หรือผู้ดูแลระบบ
    </p>
    <p>
      นอกจากนโยบายฉบับนี้แล้ว ศออ. อาจกำหนดให้มีคำประกาศเกี่ยวกับความเป็นส่วนตัว
      (“ประกาศ”) สำหรับบริการของ ศออ.
      เพื่อชี้แจงให้เจ้าของข้อมูลส่วนบุคคลซึ่งเป็นผู้ใช้บริการได้ทราบถึงข้อมูลส่วนบุคคลที่ถูกประมวลผล
      วัตถุประสงค์และเหตุผลอันชอบด้วยกฎหมายในการประมวลผล
      ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล
      รวมถึงสิทธิในข้อมูลส่วนบุคคลที่เจ้าของข้อมูลส่วนบุคคลพึงมีในผลิตภัณฑ์หรือบริการนั้นเป็นการเฉพาะเจาะจง
      ทั้งนี้
      ในกรณีที่มีความขัดแย้งกันในสาระสำคัญระหว่างความในประกาศเกี่ยวกับความเป็นส่วนตัวและนโยบายนี้
      ให้ถือตามความในประกาศเกี่ยวกับความเป็นส่วนตัวของบริการนั้น
    </p>
    <h1>2.คำนิยาม</h1>
    <p>- ศออ. หมายถึง ศูนย์รวมข้อมูลอสังหาริมทรัพย์เพื่ออยู่อาศัย</p>
    <p>
      - ข้อมูลส่วนบุคคล หมายถึง ข้อมูลเกี่ยวกับบุคคลธรรมดา
      ซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
      แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
    </p>
    <p>
      - ข้อมูลส่วนบุคคลอ่อนไหว หมายถึง ข้อมูลส่วนบุคคลตามที่ถูกบัญญัติไว้ในมาตรา
      26 แห่งพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ซึ่งได้แก่
      ข้อมูลเชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง ความเชื่อในลัทธิ
      ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ
      ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ
      หรือข้อมูลอื่นใดซึ่งกระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด
    </p>
    <p>
      - การประมวลผลข้อมูลส่วนบุคคล หมายถึง การดำเนินการใด ๆ กับข้อมูลส่วนบุคคล
      เช่น เก็บรวบรวม บันทึก สำเนา จัดระเบียบ เก็บรักษา ปรับปรุง เปลี่ยนแปลง ใช้
      กู้คืน เปิดเผย ส่งต่อ เผยแพร่ โอน รวม ลบ ทำลาย เป็นต้น
    </p>
    <p>
      - เจ้าของข้อมูลส่วนบุคคล หมายถึง
      บุคคลธรรมดาซึ่งเป็นเจ้าของข้อมูลส่วนบุคคลที่ ศออ. เก็บรวบรวม ใช้
      หรือเปิดเผย
    </p>
    <p>
      - ผู้ควบคุมข้อมูลส่วนบุคคล หมายถึง
      บุคคลหรือนิติบุคคลซึ่งมีอำนาจหน้าที่ตัดสินใจเกี่ยวกับการเก็บรวบรวม ใช้
      หรือเปิดเผยข้อมูลส่วนบุคคล
    </p>
    <p>
      - ผู้ประมวลผลข้อมูลส่วนบุคคล หมายถึง
      บุคคลหรือนิติบุคคลซึ่งดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้
      หรือเปิดเผยข้อมูลส่วนบุคคลตามคำสั่งหรือในนามของผู้ควบคุมข้อมูลส่วนบุคคล
      ทั้งนี้
      บุคคลหรือนิติบุคคลซึ่งดำเนินการดังกล่าวไม่เป็นผู้ควบคุมข้อมูลส่วนบุคคล
    </p>
    <h1>3.แหล่งที่มาของข้อมูลส่วนบุคคลที่ ศออ. เก็บรวบรวม</h1>
    <p>
      ข้อมูลส่วนบุคคลที่ ศออ.
      เก็บรวบรวมจากเจ้าของข้อมูลส่วนบุคคลโดยตรงในช่องทางให้บริการต่าง ๆ เช่น
      ขั้นตอนการสมัคร ลงทะเบียน สมัครงาน การลงประกาศอสังหาริมทรัพย์
      หรือช่องทางให้บริการอื่นที่ควบคุมดูแลโดย ศออ. เป็นต้น ทั้งนี้
      ในกรณีที่เจ้าของข้อมูลส่วนบุคคลปฏิเสธไม่ให้ข้อมูลที่มีความจำเป็นในการให้บริการของ
      ศออ. อาจเป็นผลให้ ศออ.
      ไม่สามารถให้บริการนั้นแก่เจ้าของข้อมูลส่วนบุคคลดังกล่าวได้ทั้งหมดหรือบางส่วน
    </p>
    <h1>4.ฐานกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคล</h1>
    <p>
      ศออ.
      พิจารณากำหนดฐานกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านตามความเหมาะสมและตามบริบทของการให้บริการ
      ทั้งนี้ ฐานกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคลที่ ศออ. ใช้ ประกอบด้วย
    </p>
    <p>
      1) เพื่อการดำเนินภารกิจเพื่อประโยชน์สาธารณะหรือการใช้อำนาจรัฐที่ ศออ.
      ได้รับเพื่อให้ ศออ.
      สามารถใช้อำนาจรัฐและดำเนินภารกิจเพื่อประโยชน์สาธารณะตามพันธกิจ ศออ.
      ซึ่งกำหนดไว้ตามกฎหมาย เช่น -
      พระราชกฤษฎีกาจัดตั้งสำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) พ.ศ. 2561 -
      พระราชบัญญัติการบริหารงานและการให้บริการภาครัฐผ่านระบบดิจิทัล พ.ศ. 2562
      รวมถึง กฎ ระเบียบ คำสั่งและมติคณะรัฐมนตรีที่เกี่ยวข้อง เป็นต้น
    </p>
    <p>
      2) เพื่อการปฏิบัติหน้าที่ตามกฎหมาย เพื่อให้ ศออ.
      สามารถปฏิบัติตามที่กฎหมายที่ควบคุม ศออ. เช่น -
      การเก็บรวบรวมข้อมูลจราจรทางคอมพิวเตอร์ตามพระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์
      พ.ศ. 2560 - พระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. 2540 -
      พระราขบัญญัติองค์การมหาชน พ.ศ. 2542 - กฎหมายว่าด้วยภาษีอากร รวมถึง
      การดำเนินการตามคำสั่งศาล เป็นต้น
    </p>
    <p>
      3) เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมาย
      เพื่อประโยชน์โดยชอบด้วยกฎหมายของ ศออ. และของบุคคลอื่น
      ซึ่งประโยชน์ดังกล่าวมีความสำคัญไม่น้อยไปกว่าสิทธิขั้นพื้นฐานในข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
      เช่น เพื่อการรักษาความปลอดภัยอาคารสถานที่ของ ศออ.
      หรือการประมวลผลข้อมูลส่วนบุคคลเพื่อกิจการภายในของ ศออ. เป็นต้น
    </p>
    <p>
      4) เพื่อการปฏิบัติตามสัญญา เพื่อให้ ศออ. สามารถปฏิบัติหน้าที่ตามสัญญา
      หรือดำเนินการอันเป็นความจำเป็นต่อการเข้าทำสัญญาซึ่งท่านเป็นคู่สัญญากับ
      ศออ. เช่น การจ้างงาน จ้างทำของ
      การทำบันทึกข้อตกลงความร่วมมือหรือสัญญาในรูปแบบอื่น เป็นต้น
    </p>
    <p>
      5) เพื่อการจัดทำเอกสารประวัติศาสตร์ วิจัยหรือสถิติที่สำคัญ เพื่อให้ ศออ.
      สามารถจัดทำหรือสนับสนุนการจัดทำเอกสารประวัติศาสตร์ วิจัยหรือสถิติตามที่
      ศออ. อาจได้รับมอบหมาย เช่น การจัดทำทำเนียบผู้ดำรงตำแหน่งผู้อำนวยการ
      หรือคณะกรรมการ การจัดทำสถิติการใช้บริการดิจิทัลภาครัฐ
      งานติดตามการดำเนินนโยบายรัฐบาลดิจิทัล เป็นต้น
    </p>
    <p>
      6) ความยินยอมของท่าน เพื่อการเก็บรวบรวม
      ใช้หรือเปิดเผยข้อมูลส่วนบุคคลในกรณีที่ ศออ.
      จำเป็นต้องได้รับความยินยอมจากท่าน
      โดยได้มีการแจ้งวัตถุประสงค์ของการเก็บรวบรวม ใช้
      หรือเปิดเผยข้อมูลส่วนบุคคลก่อนการขอความยินยอมแล้ว เช่น
      การเก็บรวบรวมข้อมูลส่วนบุคคลอ่อนไหวด้วยวัตถุประสงค์ที่ไม่เป็นไปตามข้อยกเว้นมาตรา
      24 หรือ 26 แห่งพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
      หรือการนำเสนอ
      ประชาสัมพันธ์ผลิตภัณฑ์และบริการของคู่สัญญาหรือพันธมิตรทางธุรกิจแก่ท่าน
      เป็นต้น
    </p>
    <p>
      ในกรณีที่ ศออ.
      มีความจำเป็นต้องเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อการปฏิบัติตามสัญญา
      การปฏิบัติหน้าที่ตามกฎหมายหรือเพื่อความจำเป็นในการเข้าทำสัญญา
      หากท่านปฏิเสธไม่ให้ข้อมูลส่วนบุคคลหรือ
      คัดค้านการดำเนินการประมวลผลตามวัตถุประสงค์ของกิจกรรม อาจมีผลทำให้ ศออ.
      ไม่สามารถดำเนินการหรือให้บริการตามที่ท่านร้องขอได้ทั้งหมดหรือบางส่วน
    </p>
    <h1>5.ประเภทของข้อมูลส่วนบุคคลที่ ศออ. เก็บรวบรวม</h1>
    <p>
      ศออ. อาจเก็บรวบรวมหรือได้มาซึ่งข้อมูลดังต่อไปนี้
      ซึ่งอาจรวมถึงข้อมูลส่วนบุคคลของท่าน ทั้งนี้
      ขึ้นอยู่กับบริการที่ท่านใช้หรือบริบทความสัมพันธ์ที่ท่านมีกับ ศออ.
      รวมถึงข้อพิจารณาอื่นที่มีผลกับการเก็บรวบรวมข้อมูลส่วนบุคคล
      โดยประเภทของข้อมูลที่ระบุไว้ดังต่อไปนี้เป็นเพียงกรอบการเก็บรวบรวมข้อมูลส่วนบุคคลของ
      ศออ. เป็นการทั่วไป ทั้งนี้
      เฉพาะข้อมูลที่เกี่ยวข้องกับผลิตภัณฑ์หรือบริการที่ท่านใช้งานหรือมีความสัมพันธ์ด้วยเท่านั้นที่จะมีผลบังคับใช้
    </p>
    <p>
      1) ข้อมูลเฉพาะตัวบุคคล
      ข้อมูลระบุชื่อเรียกของท่านหรือข้อมูลจากเอกสารราชการที่ระบุข้อมูลเฉพาะตัวของท่าน
      เช่น คำนำหน้าชื่อ ชื่อ นามสกุล เป็นต้น
    </p>
    <p>
      2) ข้อมูลสำหรับการติดต่อ ข้อมูลเพื่อการติดต่อท่าน เช่น เบอร์โทรศัพท์บ้าน
      เบอร์โทรศัพท์เคลื่อนที่ อีเมล เป็นต้น
    </p>
    <p>
      3) ข้อมูลอสังหาริมทรัพย์ ข้อมูลของอสังหาริมทรัพย์ที่ท่านเป็นผู้ถือครอง
      เช่น ขนาดอสังหาริมทรัพย์ แผนที่ตั้งของอสังหาริมทรัพย์
      ประเภทของอสังหาริมทรัพย์ รหัสไปรษณีย์ จำนวนห้องของอสังหาริมทรัพย์ เป็นต้น
    </p>
    <p>
      4) ข้อมูลเกี่ยวกับการใช้บริการของ ศออ. รายละเอียดเกี่ยวกับบริการของ ศออ.
      เช่น ชื่อผู้ใช้งาน รหัสผ่าน ข้อมูลระบุพิกัด ภาพถ่าย
      ข้อมูลพฤติกรรมการใช้งาน เป็นต้น
    </p>
    <h1>
      6.ข้อมูลส่วนบุคคลของผู้เยาว์ คนไร้ความสามารถและคนเสมือนไร้ความสามารถ
    </h1>
    <p>
      กรณีที่ ศออ.
      ทราบว่าข้อมูลส่วนบุคคลที่จำเป็นต้องได้รับความยินยอมในการเก็บรวบรวม
      เป็นของเจ้าของข้อมูลส่วนบุคคลซึ่งเป็นผู้เยาว์
      คนไร้ความสามารถหรือคนเสมือนไร้ความสามารถ ศออ.
      จะไม่ทำการเก็บรวบรวมข้อมูลส่วนบุคคลนั้นจนกว่าจะได้รับความยินยอมจากผู้ใช้อำนาจปกครองที่มีอำนาจกระทำการแทนผู้เยาว์
      หรือผู้อนุบาล หรือผู้พิทักษ์ตามแต่กรณี ทั้งนี้
      เป็นไปตามเงื่อนไขที่กฎหมายกำหนด
    </p>
    <p>
      กรณีที่ ศออ. ไม่ทราบมาก่อนว่าเจ้าของข้อมูลส่วนบุคคลเป็นผู้เยาว์
      คนไร้ความสามารถหรือคนเสมือนไร้ความสามารถ และมาพบในภายหลังว่า ศออ.
      ได้เก็บรวบรวมข้อมูลของเจ้าของข้อมูลส่วนบุคคลดังกล่าวโดยยังมิได้รับความยินยอมจากผู้ใช้อำนาจปกครองที่มีอำนาจกระทำการแทนผู้เยาว์
      หรือผู้อนุบาล หรือผู้พิทักษ์ตามแต่กรณี ดังนี้ ศออ.
      จะดำเนินการลบทำลายข้อมูลส่วนบุคคลนั้นโดยเร็วหาก ศออ.
      ไม่มีเหตุอันชอบด้วยกฎหมายประการอื่นนอกเหนือจากความยินยอมในการเก็บรวบรวม
      ใช้หรือเปิดเผยข้อมูลดังกล่าว
    </p>
    <h1>7.วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล</h1>
    <p>
      ศออ. ดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์หลายประการ
      ซึ่งขึ้นอยู่กับประเภทของบริการหรือกิจกรรมที่ท่านใช้บริการ
      ตลอดจนลักษณะความสัมพันธ์ของท่านกับ ศออ.
      หรือข้อพิจารณาในแต่ละบริบทเป็นสำคัญ
      โดยวัตถุประสงค์ที่ระบุไว้ดังต่อไปนี้เป็นเพียงกรอบการใช้ข้อมูลส่วนบุคคลของ
      ศออ. เป็นการทั่วไป ทั้งนี้
      เฉพาะวัตถุประสงค์ที่เกี่ยวข้องกับผลิตภัณฑ์หรือบริการที่ท่านใช้งานหรือมีความสัมพันธ์ด้วยเท่านั้นที่จะมีผลบังคับใช้กับข้อมูลของท่าน
    </p>
    <p>
      1) เพื่อให้บริการและบริหารจัดการบริการของ ศออ.
      ทั้งบริการภายใต้สัญญาที่มีต่อท่าน หรือตามพันธกิจของ ศออ.
    </p>
    <p>2) เพื่อการดำเนินการทางธุรกรรมของ ศออ.</p>
    <p>
      3) ควบคุมดูแล ใช้งาน ติดตาม
      ตรวจสอบและบริหารจัดการบริการเพื่ออำนวยความสะดวกและสอดคล้องกับความต้องการของท่าน
    </p>
    <p>
      4) เพื่อเก็บรักษาและปรับปรุงข้อมูลอันเกี่ยวกับท่าน
      รวมทั้งเอกสารที่มีการกล่าวอ้างถึงท่าน
    </p>
    <p>5) จัดทำบันทึกรายการการประมวลผลข้อมูลส่วนบุคคลตามที่กฎหมายกำหนด</p>
    <p>6) วิเคราะห์ข้อมูล รวมถึงแก้ไขปัญหาที่เกี่ยวกับบริการของ ศออ.</p>
    <p>
      7) เพื่อดำเนินการตามที่จำเป็นในการบริหารจัดการภายในองค์กร
      รวมถึงการรับสมัครงาน การสรรหากรรมการหรือผู้ดำรงตำแหน่งต่าง ๆ
      การประเมินคุณสมบัติ
    </p>
    <p>
      8) ป้องกัน ตรวจจับ หลีกเลี่ยง และตรวจสอบการฉ้อโกง การละเมิดความปลอดภัย
      หรือการกระทำที่ต้องห้าม หรือผิดกฎหมาย และอาจเกิดความเสียหายต่อทั้ง ศออ.
      และเจ้าของข้อมูลส่วนบุคคล
    </p>
    <p>
      9) การยืนยันตัวตน พิสูจน์ตัวตนและตรวจสอบข้อมูลเมื่อท่านสมัครใช้บริการของ
      ศออ. หรือติดต่อใช้บริการ หรือใช้สิทธิตามกฎหมาย
    </p>
    <p>10) ปรับปรุงและพัฒนาคุณภาพบริการให้ทันสมัย</p>
    <p>11) การประเมินและบริหารจัดการความเสี่ยง</p>
    <p>
      12) ส่งการแจ้งเตือน การยืนยันการทำคำสั่ง
      ติดต่อสื่อสารและแจ้งข่าวสารไปยังท่าน
    </p>
    <p>
      13) ยืนยันตัวตน ป้องกันการสแปม หรือการกระทำที่ไม่ได้รับอนุญาต
      หรือผิดกฎหมาย
    </p>
    <p>
      14) ดำเนินการตามที่จำเป็นเพื่อปฏิบัติตามหน้าที่ที่ ศออ.
      มีต่อหน่วยงานที่มีอำนาจควบคุม หน่วยงานด้านภาษี การบังคับใช้กฎหมาย
      หรือภาระผูกพันตามกฎหมายของ ศออ.
    </p>
    <p>
      15) ดำเนินการตามที่จำเป็นเพื่อประโยชน์ที่ชอบด้วยกฎหมายของ ศออ.
      หรือของบุคคลอื่น หรือของนิติบุคคลอื่นที่เกี่ยวข้องกับการการดำเนินการของ
      ศออ.
    </p>
    <p>
      16) จัดเตรียมเอกสารทางประวัติศาสตร์เพื่อประโยชน์สาธารณะ การค้นคว้า
      หรือจัดทำสถิติที่ ศออ. ได้รับมอบหมายให้ดำเนินการ
    </p>
    <p>
      17) เพื่อการปฏิบัติตามกฎหมาย ประกาศ คำสั่งที่มีผลบังคับใช้
      หรือการดำเนินการเกี่ยวกับคดีความ การดำเนินการเกี่ยวกับข้อมูลตามหมายศาล
      รวมถึงการใช้สิทธิเกี่ยวกับข้อมูลของท่าน
    </p>
    <h1>8.ประเภทบุคคลที่ ศออ. เปิดเผยข้อมูลส่วนบุคคลของท่าน</h1>
    <p>
      ภายใต้วัตถุประสงค์ที่ได้ระบุไว้ในข้อ 7 ข้างต้น ศออ.
      อาจเปิดเผยข้อมูลส่วนบุคคลของท่านให้แก่บุคคลดังต่อไปนี้ ทั้งนี้
      ประเภทของบุคคลผู้รับข้อมูลที่ระบุไว้ดังต่อไปนี้เป็นเพียงกรอบการเปิดเผยข้อมูลส่วนบุคคลของ
      ศออ. เป็นการทั่วไป
      เฉพาะบุคคลผู้รับข้อมูลที่เกี่ยวข้องกับบริการที่ท่านใช้งานหรือมีความสัมพันธ์ด้วยเท่านั้นที่จะมีผลบังคับใช้
    </p>
    <p>
      1) หน่วยงานของรัฐหรือผู้มีอำนาจที่ ศออ.
      ต้องเปิดเผยข้อมูลเพื่อวัตถุประสงค์ในการดำเนินการตามกฎหมายหรือวัตถุประสงค์สำคัญอื่น
      (เช่น การดำเนินการเพื่อประโยชน์สาธารณะ) หน่วยงานผู้บังคับใช้กฎหมาย
      หรือมีอำนาจควบคุมกำกับดูแลหรือมีวัตถุประสงค์อื่นที่มีความสำคัญ เช่น
      คณะรัฐมนตรี รัฐมนตรีผู้รักษาการ กรมการปกครอง กรมสรรพากร สำนักงานตำรวจ ศาล
      สำนักงานอัยการ กรมควบคุมโรค กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม
      สำนักงานปลัดสำนักนายก กรมการกงสุล กองทุนเงินให้กู้ยืมเพื่อการศึกษา เป็นต้น
    </p>
    <p>
      2) ผู้ใช้บริการทั่วไป ที่มีการเข้ามาใช้บริการของ ศออ. เช่น
      ผู้ประสงค์เช่าอสังหาริมทรัพย์ ผู้ประสงค์ปล่อยเช่าอสังหาริมทรัพย์
    </p>
    <p>
      3) การเปิดเผยข้อมูลต่อสาธารณะ ศออ.
      อาจเปิดเผยข้อมูลของท่านต่อสาธารณะในกรณีที่จำเป็น เช่น
      การดำเนินการที่กำหนดให้ ศออ.
      ต้องประกาศลงในราชกิจจานุเบกษาหรือมติคณะรัฐมนตรี เป็นต้น
    </p>
    <h1>9.ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน</h1>
    <p>
      ศออ.
      จะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้ในระยะเวลาเท่าที่ข้อมูลนั้นยังมีความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลหรือตามระยะเวลาที่ท่านประสงค์ท่านั้นเท่านั้น
      ตามรายละเอียดที่ได้กำหนดไว้ในนโยบาย ประกาศหรือตามกฎหมายที่เกี่ยวข้อง
      ทั้งนี้
      เมื่อพ้นระยะเวลาและข้อมูลส่วนบุคคลของท่านสิ้นความจำเป็นตามวัตถุประสงค์ดังกล่าวแล้ว
      ศออ. จะทำการลบ ทำลายข้อมูลส่วนบุคคลของท่าน
      หรือทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวตนได้ต่อไป
      ตามรูปแบบและมาตรฐานการลบทำลายข้อมูลส่วนบุคคลที่คณะกรรมการหรือกฎหมายจะได้ประกาศกำหนดหรือตามมาตรฐานสากล
      อย่างไรก็ดี ในกรณีที่มีข้อพิพาท
      การใช้สิทธิหรือคดีความอันเกี่ยวข้องกับข้อมูลส่วนบุคคลของท่าน ศออ.
      ขอสงวนสิทธิในการเก็บรักษาข้อมูลนั้นต่อไปจนกว่าข้อพิพาทนั้นจะได้มีคำสั่งหรือคำพิพากษาถึงที่สุด
    </p>
    <h1>10.สิทธิของท่านตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562</h1>
    <p>
      พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
      ได้กำหนดสิทธิของเจ้าของข้อมูลส่วนบุคคลไว้หลายประการ ทั้งนี้
      สิทธิดังกล่าวจะเริ่มมีผลบังคับใช้เมื่อกฎหมายในส่วนของสิทธินี้มีผลใช้บังคับ
      โดยรายละเอียดของสิทธิต่าง ๆ ประกอบด้วย
    </p>
    <p>
      1) สิทธิในการขอเข้าถึงข้อมูลส่วนบุคคล ท่านมีสิทธิขอเข้าถึง
      รับสำเนาและขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลที่ ศออ.
      เก็บรวบรวมไว้โดยปราศจากความยินยอมของท่าน เว้นแต่กรณีที่ ศออ.
      มีสิทธิปฏิเสธคำขอของท่านด้วยเหตุตามกฎหมายหรือคำสั่งศาล
      หรือกรณีที่การใช้สิทธิของท่านจะมีผลกระทบที่อาจก่อให้เกิดความเสียหายต่อสิทธิและเสรีภาพของบุคคลอื่น
    </p>
    <p>
      2) สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน
      หากท่านพบว่าข้อมูลส่วนบุคคลของท่านไม่ถูกต้อง ไม่ครบถ้วนหรือไม่เป็นปัจจุบัน
      ท่านมีสิทธิขอให้แก้ไขเพื่อให้มีความถูกต้อง เป็นปัจจุบัน สมบูรณ์
      และไม่ก่อให้เกิดความเข้าใจผิดได้
    </p>
    <p>
      3) สิทธิในการลบหรือทำลายข้อมูลส่วนบุคคล ท่านมีสิทธิขอให้ ศออ.
      ลบหรือทำลายข้อมูลส่วนบุคคลของท่าน
      หรือทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลได้ต่อไป
      ทั้งนี้
      การใช้สิทธิลบหรือทำลายข้อมูลส่วนบุคคลนี้จะต้องอยู่ภายใต้เงื่อนไขตามที่กฎหมายกำหนด
    </p>
    <p>
      4) สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคล
      ท่านมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลของท่าน ทั้งนี้
      ในกรณีดังต่อไปนี้
    </p>
    <p>
      ก) เมื่ออยู่ในช่วงเวลาที่ ศออ.
      ทำการตรวจสอบตามคำร้องขอของเจ้าของข้อมูลส่วนบุคคลให้แก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง
      สมบูรณ์และเป็นปัจจุบัน
    </p>
    <p>
      ข) ข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลถูกเก็บรวบรวม
      ใช้หรือเปิดเผยโดยมิชอบด้วยกฎหมาย
    </p>
    <p>
      ค)
      เมื่อข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่
      ศออ. ได้แจ้งในการเก็บรวบรวม แต่เจ้าของข้อมูลส่วนบุคคลประสงค์ให้ ศออ.
      เก็บรักษาข้อมูลนั้นต่อไปเพื่อประกอบการใช้สิทธิตามกฎหมาย
    </p>
    <p>
      ง) เมื่ออยู่ในช่วงเวลาที่ ศออ.
      กำลังพิสูจน์ถึงเหตุอันชอบด้วยกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
      หรือตรวจสอบความจำเป็นในการเก็บรวบรวม ใช้
      หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อประโยชน์สาธารณะ
      อันเนื่องมาจากการที่เจ้าของข้อมูลส่วนบุคคลได้ใช้สิทธิคัดค้านการเก็บรวบรวม
      ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
    </p>
    <p>
      5) สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล
      ท่านมีสิทธิคัดค้านการเก็บรวบรวม
      ใช้หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับท่าน เว้นแต่กรณีที่ ศออ.
      มีเหตุในการปฏิเสธคำขอโดยชอบด้วยกฎหมาย (เช่น ศออ.
      สามารถแสดงให้เห็นว่าการเก็บรวบรวม ใช้
      หรือเปิดเผยข้อมูลส่วนบุคคลของท่านมีเหตุอันชอบด้วยกฎหมายยิ่งกว่า
      หรือเพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย
      การปฏิบัติตามหรือการใช้สิทธิเรียกร้องทางกฎหมาย หรือเพื่อประโยชน์สาธารณะของ
      ศออ.)
    </p>
    <h1>11.การร้องเรียนต่อหน่วยงานผู้มีอำนาจกำกับดูแล</h1>
    <p>
      ในกรณีที่ท่านพบว่า ศออ. มิได้ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
      ท่านมีสิทธิร้องเรียนไปยังคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
      หรือหน่วยงานที่มีอำนาจกำกับดูแลที่ได้รับการแต่งตั้งโดยคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลหรือตามกฎหมาย
      ทั้งนี้ ก่อนการร้องเรียนดังกล่าว ศออ. ขอให้ท่านโปรดติดต่อมายัง ศออ.
      เพื่อให้ ศออ. มีโอกาสได้รับทราบข้อเท็จจริงและได้ชี้แจงในประเด็นต่าง ๆ
      รวมถึงจัดการแก้ไขข้อกังวลของท่านก่อนในโอกาสแรก
    </p>
    <h1>12.การปรับปรุงแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคล</h1>
    <p>
      ศออ. อาจพิจารณาปรับปรุง แก้ไขหรือเปลี่ยนแปลงนโยบายนี้ตามที่เห็นสมควร
      และจะทำการแจ้งให้ท่านทราบผ่านช่องทางเว็บไซต์
      โดยมีวันที่มีผลบังคับใช้ของแต่ละฉบับแก้ไขกำกับอยู่ อย่างไรก็ดี ศออ.
      ขอแนะนำให้ท่านโปรดตรวจสอบเพื่อรับทราบนโยบายฉบับใหม่อย่างสม่ำเสมอ
      ผ่านแอปพลิเคชั่น หรือช่องทางเฉพาะกิจกรรมที่ ศออ. ดำเนินการ
      โดยเฉพาะก่อนที่ท่านจะทำการเปิดเผยข้อมูลส่วนบุคคลแก่ ศออ.
    </p>
    <p>
      การเข้าใช้งานผลิตภัณฑ์หรือบริการของ ศออ. ภายหลังการบังคับใช้นโยบายใหม่
      ถือเป็นการรับทราบตามข้อตกลงในนโยบายใหม่แล้ว ทั้งนี้
      โปรดหยุดการเข้าใช้งานหากท่านไม่เห็นด้วยกับรายละเอียดในนโยบายฉบับนี้และโปรดติดต่อมายัง
      ศออ. เพื่อชี้แจงข้อเท็จจริงต่อไป
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style scoped>
.term-header{
  text-align: center;
}
.term-wrapper {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
}

.term-wrapper h1 {
  font-size: 1.3rem;
  font-weight: bold;
  margin-bottom: 1rem;
}

.term-wrapper p {
  font-size: 1rem;
  line-height: 1.5;
}
</style>
